Revit 2026 API

# FamilySymbolStructuralMaterialType Property

---

This property returns the physical material from which the type is made.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public StructuralMaterialType StructuralMaterialType { get; }
```
```vb
Public ReadOnly Property StructuralMaterialType As StructuralMaterialType
	Get
```
```cpp
public:
property StructuralMaterialType StructuralMaterialType {
	StructuralMaterialType get ();
}
```
```fsharp
member StructuralMaterialType : StructuralMaterialType with get
```

#### Property Value

StructuralMaterialType

Values of this property can be Steel, Concrete, Wood or some other material.

#### Reference

FamilySymbol Class

Autodesk.Revit.DB Namespace